{
  "stage": 4,
  "title": "Integration",
  "exercises": [
    {
      "id": "4.1",
      "title": "Full Chapter Proof",
      "type": "integrated-proof",
      "instructions": "This 10-page chapter contains all error types: spelling, punctuation, dialogue, and consistency. Find and mark all errors while maintaining a style sheet.",
      "passage": {
        "title": "Chapter Seven: The Return",
        "word_count_approx": 2500,
        "pages_approx": 10,
        "paragraphs": [
          "It was raining when Catherine finally arrived home. The journey from Edinburgh had taken nearly eight hours—delays at York, a missed connection at Peterborough—and she was exhausted. She paid the taxi driver and stood for a moment in the downpour, looking up at the house where she had grown up.",
          "",
          "Nothing had changed. The same grey stone, the same bay window with its faded curtains, the same overgrown garden that her father had always meant to tidy. Only now, her father was gone.",
          "",
          "'You must be Katherine,' said a voice behind her.",
          "",
          "She turned. A woman stood under an umbrella, watching her. Middle-aged, grey haired, dressed in a waterproof jacket.",
          "",
          "'I'm Catherine,' she corrected. 'And you are?'",
          "",
          "'Mrs Blackwood. Your fathers solicitor asked me to meet you here.' The woman extended a hand. 'I have the keys.'",
          "",
          "They walked up the path together. The front door was exactly as Catherine remebered it—dark green, with a brass knocker in the shape of a lions head.",
          "",
          "'When did he die?' she asked, as Mrs Blackwood fumbled with the keys.",
          "",
          "'Tuesday last week. The neighbours found him. He hadn't been seen for three days.' Mrs. Blackwood pushed open the door. 'I'm sorry for your loss.'",
          "",
          "The hallway smelled of dust and old books. Catherine's eyes adjusted to the gloom. Everything was where it had always been: the coat stand, the mirror, the photograph of her mother that had hung there for thirty years.",
          "",
          "'I'll leave you to look around,' said Mrs Blackwood. 'The solicitor will be in touch about the will. He left everything to you, apparently. The house, his savings, everything'",
          "",
          "'Thank you.' Catherine waited until the woman had gone, then closed the door behind her.",
          "",
          "She walked through to the living room. Her father's armchair sat by the window, a book face-down on the armrest. She picked it up: a biography of Churchill, bookmarked half-way through. He would never finish it now.",
          "",
          "The kitchen was worse. Dishes in the sink, an empty whisky bottle on the counter, a calender on the wall still showing October. It was now December, nearly christmas.",
          "",
          "Catherine opened the fridge. Milk, long past its sell-by date. Butter. Half a lemon. The lonely provisions of a man living alone.",
          "",
          "She sat down at the kitchen table and cried. She hadn't seen her father in two years—not since their argument about the wedding. He had refused to come, had called David 'that man', had said things that could not be unsaid. And now he was dead, and she would never have the chance to make it right.",
          "",
          "'I'm sorry, Dad,' she whispered. 'I should have called. I should have come.'",
          "",
          "But she hadnt. She had been stubborn, proud, just like him. And now it was too late.",
          "",
          "After a while, she stood and went upstairs. Her old bedroom was at the end of the corridor. The door was closed.",
          "",
          "She hesitated, then pushed it open.",
          "",
          "Her father had kept it exactly as she'd left it. The same posters on the walls—bands she no longer listened to. The same books on the shelves—novels she had read as a teenager. Even the same bedspread, faded now, that she had chosen when she was fifteen.",
          "",
          "On the bedside table was a photograph. Catherine and her father, standing outside the house on the day she left for university. She was eighteen in the picture, full of excitement and terror. Her father was fifty-two, already greying, his arm around her shoulders.",
          "",
          "'I tried to call you, you know', she said to the empty room. 'Last month. Your phone just rang and rang.'",
          "",
          "Had he been dead then? Had he been lying in this house, alone, while his phone rang unanswered? The thought was unbearable.",
          "",
          "She went into her father's bedroom. It was neat, almost spartan—a single bed, a wardrobe, a desk by the window. On the desk was a pile of letters, neatly stacked.",
          "",
          "Catherine sat down and began to read.",
          "",
          "The first letter was from her, dated three years ago. I know you don't approve, she had written, but David makes me happy. I wish you could see that.",
          "",
          "Her father had kept it. He had kept all of them—every letter she had ever sent, from her first term at university to her last, angry note two years ago.",
          "",
          "Beneath the letters was a notebook. Catherine opened it.",
          "",
          "January 15th, her father had written. Still no word from Catherine. I pick up the phone every day, but I don't know what to say. How do you apologise for being a fool?",
          "",
          "March 3rd. Saw a photograph of her in The Times—some work event. She looked happy. That's all I ever wanted for her.",
          "",
          "November 20th. The doctor says I should 'get my affairs in order.' I've written to the solicitor. Everything goes to Catherine. I hope she knows how much I loved her, even when I couldn't show it.",
          "",
          "Catherine closed the notebook, her hands trembling. He had been dying. He had been dying, and he had spent his last months thinking of her, regretting their estrangement.",
          "",
          "She looked around the room—at the neat bed, the careful stack of letters, the notebook filled with his cramped handwriting. This was what remained of a life. This was what remained of her father.",
          "",
          "'I forgive you,' she said. 'And I'm sorry, too.'",
          "",
          "Outside, the rain had stopped. Catherine went to the window and looked out at the garden. The lawn was overgrown, the flowerbeds choked with weeds. But in the corner, by the old apple tree, she could see daffodills pushing through the soil. Spring would come, eventually. It always did.",
          "",
          "She would stay, she decided. Not forever—she had a life in Edinburgh, a husband who loved her—but for a while. Long enough to sort through her father's things. Long enough to say goodbye properly.",
          "",
          "There was a knock at the front door. Catherine went downstairs to answer it.",
          "",
          "A man stood on the doorstep—elderly, white-haired, leaning on a walking stick.",
          "",
          "'You must be Katherine,' he said. 'I'm Geoffrey, from next door. I was your father's friend.'",
          "",
          "'It's Catherine, actually.' She stepped back to let him in. 'Would you like some tea?'",
          "",
          "'I would.' Geoffrey followed her through to the kitchen. 'I was with him at the end, you know. He talked about you constantly. He was so proud of you—even when he couldn't say it.'",
          "",
          "Catherine filled the kettle. 'I wish he had said it. I wish he had picked up the phone.'",
          "",
          "'So did he.' Geoffrey sat down at the table. 'He showed me your letters. All of them. He read them over and over.'",
          "",
          "She set out cups and saucers—her mother's china, still in the cupboard after all these years. 'Why didnt he call? If he wanted to reconcile, why didn't he just call?'",
          "",
          "'Pride,' Geoffrey said simply. 'The same reason you didn't call him, I expect. You Harringtons are all the same. Stubborn as mules, the lot of you.'",
          "",
          "Catherine laughed despite herself. 'He used to say that about Mum.'",
          "",
          "'She was worse than him, if you can believe it.' Geoffrey accepted his tea with a grateful nod. 'They were well matched, those two. God, how I miss them both.'",
          "",
          "They sat in silence for a moment, drinking tea, remebering.",
          "",
          "'What will you do with the house?' Geoffrey asked eventually.",
          "",
          "'I don't know. Sell it, I suppose. I can't imagine living here again.'",
          "",
          "'It would be a shame to see it go out of the family. But I understand.' He set down his cup. 'Whatever you decide, know that your father loved you. Never doubt that.'",
          "",
          "After Geoffrey left, Catherine returned to her father's study. She had work to do—papers to sort, arrangements to make, a lifetime of accumulated possessions to deal with.",
          "",
          "But first, she picked up the notebook and read it again, from begining to end.",
          "",
          "When she was finished, she held it to her chest and closed her eyes.",
          "",
          "'Goodbye, Dad,' she whispered. 'I love you too.'"
        ]
      },
      "errors": {
        "spelling": [
          {"location": "para 7", "error": "remebered", "correction": "remembered"},
          {"location": "para 15", "error": "calender", "correction": "calendar"},
          {"location": "para 15", "error": "christmas", "correction": "Christmas"},
          {"location": "para 19", "error": "hadnt", "correction": "hadn't"},
          {"location": "para 41", "error": "daffodills", "correction": "daffodils"},
          {"location": "para 53", "error": "didnt", "correction": "didn't"},
          {"location": "para 59", "error": "remebering", "correction": "remembering"},
          {"location": "para 65", "error": "begining", "correction": "beginning"}
        ],
        "punctuation": [
          {"location": "para 4", "error": "grey haired", "correction": "grey-haired"},
          {"location": "para 6", "error": "Your fathers", "correction": "Your father's"},
          {"location": "para 7", "error": "lions head", "correction": "lion's head"},
          {"location": "para 9", "error": "Mrs. Blackwood", "correction": "Mrs Blackwood"},
          {"location": "para 11", "error": "missing full stop", "correction": "everything."},
          {"location": "para 14", "error": "half-way", "correction": "halfway"},
          {"location": "para 25", "error": "know'", "correction": "know,'"}
        ],
        "consistency": [
          {"location": "para 3", "error": "Katherine (should be Catherine)", "correction": "Catherine"},
          {"location": "para 45", "error": "Katherine (should be Catherine)", "correction": "Catherine"},
          {"location": "para 9", "error": "Mrs. Blackwood (vs Mrs Blackwood)", "correction": "Mrs Blackwood"}
        ],
        "dialogue": [
          {"location": "para 25", "error": "missing comma before closing quote", "correction": "'I tried to call you, you know,'"}
        ]
      },
      "total_errors": 19,
      "style_sheet_notes": [
        "Catherine (NOT Katherine)",
        "Mrs Blackwood (no full stop)",
        "David (husband)",
        "Geoffrey (neighbour)",
        "Edinburgh, York, Peterborough (places)",
        "grey (British spelling)",
        "Harrington family"
      ]
    },
    {
      "id": "4.2",
      "title": "Query Practice",
      "type": "query-writing",
      "instructions": "For each scenario, decide whether to fix silently, query, or leave alone. If querying, write an appropriate query.",
      "items": [
        {
          "id": 1,
          "scenario": "A character is described as having 'hazel eyes' on page 12, but 'brown eyes' on page 145. The rest of the manuscript uses 'hazel eyes'.",
          "options": ["fix_silently", "query", "leave_alone"],
          "best_answer": "query",
          "explanation": "Both terms could apply to similar eye colours. Query to confirm author's intent rather than assuming.",
          "sample_query": "p. 145: 'brown eyes' — but 'hazel eyes' on p. 12 and throughout. Please confirm preferred description for consistency."
        },
        {
          "id": 2,
          "scenario": "The author consistently uses 'realise' throughout, but one instance says 'realize'.",
          "options": ["fix_silently", "query", "leave_alone"],
          "best_answer": "fix_silently",
          "explanation": "Clear consistency error. The author's preference is evident from the rest of the text. Fix to 'realise'.",
          "sample_query": null
        },
        {
          "id": 3,
          "scenario": "A character says 'I ain't going nowhere' in dialogue.",
          "options": ["fix_silently", "query", "leave_alone"],
          "best_answer": "leave_alone",
          "explanation": "Non-standard English in dialogue is usually intentional — it's the character's voice. Don't correct.",
          "sample_query": null
        },
        {
          "id": 4,
          "scenario": "The text states that World War II ended in 1946.",
          "options": ["fix_silently", "query", "leave_alone"],
          "best_answer": "query",
          "explanation": "Factual error (WWII ended 1945), but don't assume — query in case there's a reason.",
          "sample_query": "p. X: WWII ending dated as 1946 — generally given as 1945. Please verify."
        },
        {
          "id": 5,
          "scenario": "You find 'drawing room' and 'drawing-room' used interchangeably. First instance is 'drawing room'.",
          "options": ["fix_silently", "query", "leave_alone"],
          "best_answer": "fix_silently",
          "explanation": "Hyphenation consistency. First instance sets the style. Change all 'drawing-room' to 'drawing room' (or vice versa, noting which came first).",
          "sample_query": null
        }
      ]
    },
    {
      "id": "4.3",
      "title": "Timed Chapter Proof",
      "type": "timed-proof",
      "instructions": "Proof this chapter in 30 minutes. Mark all errors and note your completion time.",
      "time_limit_minutes": 30,
      "passage": {
        "title": "The Letter",
        "note": "This exercise uses the Stage 1 test passage to build speed on familiar content. Refer to stage-1/test-passage.json for content.",
        "word_count_approx": 800
      },
      "purpose": "Speed building — same content as Stage 1, now with time pressure and all skills active."
    }
  ]
}
