{
  "stage": 5,
  "title": "Speed & Final Assessment",
  "exercises": [
    {
      "id": "5.1",
      "title": "Speed Drill 1",
      "type": "timed-proof",
      "instructions": "Proof this passage as quickly as possible while maintaining accuracy. Target: 12 minutes.",
      "time_limit_minutes": 12,
      "passage": {
        "title": "The Garden Party",
        "word_count_approx": 800,
        "paragraphs": [
          "The Hendersons were throwing their annual garden party, and everything had to be perfect. Mrs Henderson had been planning it for weeks—the flowers, the food, the guest list. Nothing could go wrong.",
          "",
          "'Have you seen the caterers?' she asked her husband, who was reading the newspaper in the conservatory.",
          "",
          "'They'll be here at two,' he said, not looking up. 'Same as every year.'",
          "",
          "'It's already half past one!' Mrs. Henderson checked her watch. 'What if they're late? What if the food isn't ready? What if—'",
          "",
          "'Margaret, sit down.' Mr Henderson finally lowered his paper. 'The caterers have never been late. The food will be fine. The party will be wonderful, just like it always is.'",
          "",
          "But Margaret couldn't relax. She walked out into the garden, inspecting the preparations. The marquee was up, it's white canvas gleaming in the afternoon sun. The tables were laid with white linen and silver cutlery. The flower arrangements—roses and hydrangeas from her own garden—sat in crystal vases on each table.",
          "",
          "Everything looked perfect. So why was she so anxious?",
          "",
          "The truth was, she had invited someone new this year. Someone who hadn't been to the garden party before. Someone who made her feel like a nervous schoolgirl.",
          "",
          "Dr James Whitfield was a new arrival to the village. A widower, recently retired from a succesful medical practice in London. He had moved into the old Rectory at the end of the lane, and Margaret had met him at the post office three weeks ago.",
          "",
          "They had talked for nearly an hour. About gardening, about books, about the challenges of village life. He had made her laugh—something she realised she hadn't done in a long time.",
          "",
          "When she had invited him to the party, her heart had been pounding. When he had accepted, she had felt like she might float away.",
          "",
          "'The caterers are here,' called her husband from the house.",
          "",
          "Margaret turned and walked back inside, trying to calm her racing thoughts. It was just a party. Dr Whitfield was just a guest. There was nothing to be nervous about.",
          "",
          "But as she helped direct the caterers, she found herself glancing at the clock every few minutes. Three o'clock, the invitations had said. The guest's would start arriving soon.",
          "",
          "At quarter to three, she went upstairs to change. Her best dress—the blue silk one that brought out the colour of her eyes—was laid out on the bed. She had bought it especailly for today, though she would never admit that to anyone.",
          "",
          "At five minutes to three, she came back downstairs. Her husband was already greeting the first arrivals: the Petersons from next door, and the vicar with his wife.",
          "",
          "'You look lovely,' Mr Henderson said, kissing her cheek.",
          "",
          "'Thank you.' She accepted a glass of champagne from a passing waiter. Her hand was trembling slightly.",
          "",
          "At ten past three, Dr Whitfield arrived.",
          "",
          "He was wearing a pale linen suit, perfectly pressed. His grey hair was swept back from his forehead, and he carried a bouquet of flowers—white roses, tied with a blue ribbon.",
          "",
          "'Mrs Henderson,' he said, his eyes crinkling as he smiled. 'Thank you for inviting me. Your garden is beautiful.'",
          "",
          "'Thank you for comming.' She accepted the flowers, hoping he couldn't see how much her hands were shaking. 'Please, let me introduce you to some of the other guests.'",
          "",
          "As they walked through the garden together, Margaret felt something she hadn't felt in years. Hope. Possibility. The sense that life might still hold suprises.",
          "",
          "The party was wonderful—just like her husband had promised. The food was excellent, the weather was perfect, and Dr Whitfield stayed until the very end, helping her carry empty glasses back to the kitchen.",
          "",
          "'Same time next year?' he asked, as he was leaving.",
          "",
          "Margaret smiled. 'I certainly hope so.'",
          "",
          "She watched him walk down the lane, her heart full. Behind her, her husband was saying something about the mess, about the washing up, about being tired. She barely heard him.",
          "",
          "Life, she thought, was full of suprises."
        ]
      },
      "errors": [
        {"location": "para 4", "error": "Mrs. Henderson", "correction": "Mrs Henderson"},
        {"location": "para 6", "error": "it's white canvas", "correction": "its white canvas"},
        {"location": "para 10", "error": "succesful", "correction": "successful"},
        {"location": "para 15", "error": "guest's", "correction": "guests"},
        {"location": "para 16", "error": "especailly", "correction": "especially"},
        {"location": "para 23", "error": "comming", "correction": "coming"},
        {"location": "para 24", "error": "suprises", "correction": "surprises"},
        {"location": "para 28", "error": "suprises", "correction": "surprises"}
      ],
      "total_errors": 8,
      "target_accuracy": 0.90,
      "time_tracking": true
    },
    {
      "id": "5.2",
      "title": "Speed Drill 2",
      "type": "timed-proof",
      "instructions": "Proof this passage in 10 minutes. Increased speed, same accuracy requirement.",
      "time_limit_minutes": 10,
      "passage": {
        "title": "The Interview",
        "word_count_approx": 700,
        "paragraphs": [
          "The waiting room was cold and uninviting. Sarah sat on a hard plastic chair, her hands clasped tightly in her lap. Around her, other candidates shuffled nervously through their notes.",
          "",
          "'Miss Taylor?' A woman in a grey suit appeared in the doorway. 'They're ready for you now.'",
          "",
          "Sarah stood, smoothing down her skirt. This was it. The job she had been working towards for years. Senior Editor at Blackwell Publishing—it was everything she had ever wanted.",
          "",
          "The interview room was large and intimidating. Three people sat behind a long table: two men and a woman, all watching her with expressionless faces.",
          "",
          "'Please, take a seat.' The woman in the middle gestured to a chair. 'I'm Helena Blackwell, Managing Director. This is James Chen, our Head of Fiction, and Robert Okonkwo, Head of Non-Fiction.'",
          "",
          "Sarah sat, trying to control her nervouse energy. 'Thank you for seeing me.'",
          "",
          "'Your application was impressive,' Mrs Blackwell said, glancing at a folder in front of her. 'Ten years experience, excellent references, a strong portfolio. Tell me—why do you want to work at Blackwells?'",
          "",
          "Sarah had prepared for this question. 'Blackwell's has always been my dream company. Your commitment to quality, your willingness to take risks on new voices—' She paused. 'I want to be part of that. I want to help shape the future of British publishing.'",
          "",
          "Mr. Chen leaned forward. 'What would you say is your greatest weakness?'",
          "",
          "Sarah smiled. 'I'm a perfectionist. I know that sounds like a cliché, but it's true. I can't let a manuscript go until I'm absolutely certain it's the best it can be. Somtimes that means working late, missing deadlines—'",
          "",
          "'That's not necessarily a weakness,' Mr Okonkwo said. 'In this industry, perfectionism can be an asset.'",
          "",
          "'It can also be a liability,' Mrs Blackwell countered. 'Publishing is a buisness. We need editors who can deliver on time, every time.' She fixed Sarah with a sharp gaze. 'Can you do that?'",
          "",
          "'Yes.' Sarah kept her voice steady. 'I understand the balance. Quality and efficiency aren't mutually exclusive—they're both essential.'",
          "",
          "The interview lasted another thirty minutes. They asked about her favourite books, her experience with difficult authors, her vision for the imprints future. Sarah answered each question carefully, drawing on years of experience.",
          "",
          "Finally, Mrs Blackwell closed her folder. 'Thank you, Miss Taylor. We'll be in touch.'",
          "",
          "Sarah walked out of the building, her heart pounding. Had she done enough? Had she said the right things? The waiting was going to be unbearable.",
          "",
          "Three days later, her phone rang.",
          "",
          "'Miss Taylor? It's Helena Blackwell. I have some news for you.'",
          "",
          "Sarah held her breathe.",
          "",
          "'Congratulations. The job is yours.'"
        ]
      },
      "errors": [
        {"location": "para 6", "error": "nervouse", "correction": "nervous"},
        {"location": "para 7", "error": "Mrs Blackwell... Blackwells", "correction": "Blackwell's (consistency)"},
        {"location": "para 9", "error": "Mr. Chen", "correction": "Mr Chen"},
        {"location": "para 10", "error": "Somtimes", "correction": "Sometimes"},
        {"location": "para 12", "error": "buisness", "correction": "business"},
        {"location": "para 14", "error": "imprints future", "correction": "imprint's future"},
        {"location": "para 19", "error": "breathe", "correction": "breath"}
      ],
      "total_errors": 7,
      "target_accuracy": 0.90,
      "time_tracking": true
    },
    {
      "id": "5.3",
      "title": "Full Simulation",
      "type": "timed-proof",
      "instructions": "This is a full simulation of final assessment conditions. Proof this passage in 40 minutes while maintaining a style sheet.",
      "time_limit_minutes": 40,
      "passage": {
        "title": "The Last Day",
        "word_count_approx": 2000,
        "pages_approx": 8,
        "note": "Full-length passage for simulation. Combines all error types. Requires style sheet submission.",
        "content": "See stage-5/simulation-passage.md for full text"
      },
      "total_errors": 30,
      "target_accuracy": 0.95,
      "requires_style_sheet": true
    }
  ]
}
