{
  "stage": 5,
  "test": "Final Assessment",
  "title": "Proofreading Certification Assessment",
  "time_limit_minutes": 45,
  "pass_threshold": 0.98,
  "max_false_positives": 3,
  "total_errors": 40,
  "requirements": [
    "Catch at least 39 of 40 errors (98%)",
    "No more than 3 false positives",
    "Complete within 45 minutes",
    "Submit a complete, usable style sheet"
  ],
  "passage": {
    "title": "The Sisters",
    "word_count_approx": 3000,
    "pages_approx": 12,
    "paragraphs": [
      "The house had been empty for six months when Josephine finally returned. She stood at the gate, her suitcase at her feet, looking up at the building where she had grown up. Nothing had changed—the same red brick, the same bay windows, the same wisteria climbing the front wall. Only now, her sister was gone.",
      "",
      "Phillipa had died in March, suddenly and without warning. A heart attack, the doctors said. She had been fifty-two years old—the same age their mother had been when she died. Josephine had flown back from Toronto as soon as she heard, but she had arrived too late. Phillipa was already in the ground by the time her plane touched down.",
      "",
      "'Miss Harrington?' A woman emerged from the house next door. 'I'm Mrs Davies. I was your sisters neighbour.'",
      "",
      "'Hello, Mrs. Davies.' Josephine shook her hand. 'Thank you for looking after the house.'",
      "",
      "'It was the least I could do. Phillipa was a wonderful woman.' Mrs Davies produced a key from her pocket. 'I've been watering the plants and collecting the post. There's quite a pile of it on the kitchen table.'",
      "",
      "Josephine took the key. 'I appreciate it. I know this must have been difficult for you too.'",
      "",
      "'We were friends for twenty years.' Mrs Davies's eyes were bright with unshed tears. 'I still can't beleive she's gone.'",
      "",
      "The house smelled of dust and silence. Josephine walked through the hallway, running her fingers along the wallpaper. Phillipa had redecorated since her last visit—new carpets, new curtains, everything fresh and modern. It didn't feel like their childhood home anymore.",
      "",
      "The kitchen was exactly as Mrs Davies had described. A pile of post sat on the table: bills, mostly, and sympathy cards from people Josephine didn't know. She would have to go through it all eventually, but not today. Today, she just needed to be here.",
      "",
      "She made herself a cup of tea and sat down at the table. Through the window, she could see the garden—overgrown now, but still beautiful. Phillipa had inherited their mothers gift for gardening. Every spring, the flower beds would explode with colour: tulips and daffodils in April, roses and lavender in June.",
      "",
      "'I should have come back sooner,' Josephine said aloud. The words echoed in the empty kitchen. 'I should have visited more.'",
      "",
      "But she hadn't. Work had always got in the way—meetings and deadlines and the thousand small emergencies that made up a life. She had told herself there would be time. There was always time. Until suddenly there wasn't.",
      "",
      "The last time she had seen Phillipa was Christmas, two years ago. They had argued—about what, Josephine could barely remember. Something trivial, something stupid. They had parted on bad terms, promising to call each other soon.",
      "",
      "Neither of them had called. Two years of silence, and now it was too late.",
      "",
      "Josephine finished her tea and went upstairs. Phillipa's bedroom was at the end of the corridor, overlooking the garden. The door was closed.",
      "",
      "She hesitated, her hand on the handle. This felt like trespassing, somehow. This was Phillipa's private space—her sanctuary. Going in without permission felt wrong.",
      "",
      "'She's gone,' Josephine reminded herself. 'There's no-one to ask permission from.'",
      "",
      "She opened the door.",
      "",
      "The room was neat, almost spartan. A double bed with a white duvet. A wardrobe, a chest of drawers, a desk by the window. On the desk was a photograph of the two of them—Josephine and Phillipa, aged perhaps eight and ten, standing outside this very house.",
      "",
      "'I remember that day,' Josephine whispered. 'Mum took that photograph. It was the day we got the kitten.'",
      "",
      "The kitten had been called Marmalade, on account of his orange fur. He had lived for eighteen years—longer than most cats—and had died just before Josephine left for Canada. She had cried for days.",
      "",
      "On the bedside table was a notebook. Josephine picked it up and opened it.",
      "",
      "January 15th, Phillipa had written. Still no word from Josie. I think about calling her every day, but I don't know what to say. How do you apologise for two years of silence?",
      "",
      "Josephine's heart clenched. Josie. No-one had called her that since childhood. Only Phillipa, only ever Phillipa.",
      "",
      "She read on.",
      "",
      "February 3rd. The doctor says my heart isn't as strong as it should be. He wants me to 'take things easy'—whatever that means. I should tell Josie, but I don't want to worry her. She has enough on her plate.",
      "",
      "February 20th. I've been thinking about Mum a lot lately. She was fifty two when she died—the same age I am now. I always wondered if that was a coincidence. Now I'm starting to wonder if it's a warning.",
      "",
      "March 1st. I called Josie today. She didn't answer. I left a message, but I don't know if she'll call back. I hope she does. There's so much I need to say to her.",
      "",
      "There were no more entries.",
      "",
      "Josephine closed the notebook, tears streaming down her face. March 1st. That was five days before Phillipa died. Five days in which Josephine could have called back, could have made things right.",
      "",
      "She hadn't. She had been busy—a deadline, a meeting, something that had seemed important at the time. She had told herself she would call at the weekend. And then the weekend had come, and with it the news that her sister was dead.",
      "",
      "'I'm sorry,' she whispered. 'I'm so, so sorry.'",
      "",
      "She stayed in Phillipa's room for a long time, holding the notebook to her chest. Outside, the light was fading—late afternoon sliding into evening. Somewhere in the garden, a bird was singing.",
      "",
      "Eventually, she stood and went to the wardrobe. Phillipa's clothes hung in neat rows: blouses and skirts and dresses, all organised by colour. At the back was a box—old, battered, familiar.",
      "",
      "'The memory box,' Josephine breathed.",
      "",
      "They had made it together, when they were children. A shoebox covered in wrapping paper, filled with treasures: photographs, letters, small objects that meant nothing to anyone else but everything to them.",
      "",
      "She carried it to the bed and opened it.",
      "",
      "The first thing she saw was a photograph of their mother. Young, laughing, holding a baby in her arms. On the back, in their mother's handwriting: Phillipa, three months old. My darling girl.",
      "",
      "Beneath it was another photograph: Josephine as a toddler, sitting on her fathers knee. He was smiling at the camera, his eyes full of love. He had died when Josephine was seven—she barely remembered him now.",
      "",
      "There were letters, too. Notes they had passed to each other in school, carefully preserved. Birthday cards, Valentines, drawings they had made as children. A lifetime of sisterhood, captured in this small box.",
      "",
      "At the bottom was an envelope, sealed. Josephines name was written on the front in Phillipa's handwriting.",
      "",
      "She opened it with trembling hands.",
      "",
      "My dearest Josie, the letter began.",
      "",
      "If you're reading this, then I'm gone. I'm sorry I couldn't say goodbye properly. I'm sorry for the argument, for the silence, for all the things I should have said but didnt.",
      "",
      "I want you to know that I never stopped loving you. Not for a single day. You are my sister, my best friend, my other half. Nothing could ever change that.",
      "",
      "I'm leaving you the house. I know you have a life in Canada, but I hope you'll come back sometimes. This is where we grew up. This is where our memories live. I couldn't bear the thought of strangers living here, walking through our childhood.",
      "",
      "Take care of the garden for me. Plant something beautiful. And remember me, when the roses bloom.",
      "",
      "All my love, always,",
      "",
      "Phillipa",
      "",
      "Josephine read the letter three times, crying so hard she could barely see the words. Then she folded it carefully and put it in her pocket, close to her heart.",
      "",
      "She would stay. Not forever—she had a life in Toronto, commitments she couldn't abandon—but for a while. Long enough to sort through Phillipa's things. Long enough to plant something beautiful in the garden. Long enough to say goodbye properly.",
      "",
      "It was the least she could do. It was all she could do. And she hoped, wherever Phillipa was now, that it would be enough."
    ]
  },
  "errors": [
    {"id": 1, "type": "name", "location": "para 2", "error": "Phillipa", "note": "First instance — check consistency"},
    {"id": 2, "type": "apostrophe", "location": "para 3", "error": "sisters neighbour", "correction": "sister's neighbour"},
    {"id": 3, "type": "title", "location": "para 4", "error": "Mrs. Davies", "correction": "Mrs Davies"},
    {"id": 4, "type": "spelling", "location": "para 7", "error": "beleive", "correction": "believe"},
    {"id": 5, "type": "apostrophe", "location": "para 10", "error": "mothers gift", "correction": "mother's gift"},
    {"id": 6, "type": "punctuation", "location": "para 17", "error": "no-one", "note": "Check consistency — 'no-one' vs 'no one'"},
    {"id": 7, "type": "number", "location": "para 27", "error": "fifty two", "correction": "fifty-two"},
    {"id": 8, "type": "apostrophe", "location": "para 40", "error": "fathers knee", "correction": "father's knee"},
    {"id": 9, "type": "apostrophe", "location": "para 42", "error": "Josephines name", "correction": "Josephine's name"},
    {"id": 10, "type": "apostrophe", "location": "para 46", "error": "didnt", "correction": "didn't"},
    {"id": 11, "type": "consistency", "location": "throughout", "error": "Phillipa spelling", "note": "Verify consistent throughout — some sources use 'Philippa'"},
    {"id": 12, "type": "consistency", "location": "para 7", "error": "Mrs Davies's", "note": "Possessive of Davies — check style guide"},
    {"id": 13, "type": "capitalisation", "location": "para 10", "error": "April... June", "note": "Months capitalised correctly — NOT an error", "is_control": true},
    {"id": 14, "type": "hyphen", "location": "para 2", "error": "fifty-two years old", "note": "Correctly hyphenated — NOT an error", "is_control": true},
    {"id": 15, "type": "dialogue", "location": "para 11", "error": "said aloud", "note": "Full stop inside quote — check", "is_control": true},
    {"id": 16, "type": "consistency", "location": "para 17 vs 24", "error": "no-one", "note": "Both use 'no-one' — consistent", "is_control": true},
    {"id": 17, "type": "name", "location": "para 21", "error": "Marmalade", "note": "Proper noun — capitalised correctly", "is_control": true}
  ],
  "confirmed_errors": [
    {"id": 1, "location": "para 3", "error": "sisters neighbour", "correction": "sister's neighbour", "type": "apostrophe"},
    {"id": 2, "location": "para 4", "error": "Mrs. Davies", "correction": "Mrs Davies", "type": "title"},
    {"id": 3, "location": "para 7", "error": "beleive", "correction": "believe", "type": "spelling"},
    {"id": 4, "location": "para 10", "error": "mothers gift", "correction": "mother's gift", "type": "apostrophe"},
    {"id": 5, "location": "para 19", "error": "perhaps eight and ten", "note": "Word order/clarity query", "type": "query"},
    {"id": 6, "location": "para 21", "error": "on account of", "note": "Slightly archaic — but may be intentional", "type": "style"},
    {"id": 7, "location": "para 27", "error": "fifty two", "correction": "fifty-two", "type": "hyphen"},
    {"id": 8, "location": "para 40", "error": "fathers knee", "correction": "father's knee", "type": "apostrophe"},
    {"id": 9, "location": "para 42", "error": "Josephines name", "correction": "Josephine's name", "type": "apostrophe"},
    {"id": 10, "location": "para 46", "error": "didnt", "correction": "didn't", "type": "apostrophe"}
  ],
  "style_sheet_requirements": {
    "characters": [
      "Josephine (Josie) — protagonist, lives in Toronto",
      "Phillipa — Josephine's sister, deceased at 52",
      "Mrs Davies — neighbour, friend of Phillipa's for 20 years",
      "Mother — died at 52 (same age as Phillipa)",
      "Father — died when Josephine was 7",
      "Marmalade — childhood cat, orange, lived 18 years"
    ],
    "places": [
      "Toronto, Canada",
      "The family house (red brick, bay windows, wisteria)"
    ],
    "terms": [
      "no-one (hyphenated throughout)",
      "grey (British spelling — verify if used)",
      "colour (British spelling)"
    ],
    "dates_times": [
      "January 15th, February 3rd, etc. (ordinal style)",
      "Christmas, two years ago"
    ],
    "notes": [
      "Phillipa spelling consistent throughout",
      "Mrs Davies (no full stop)",
      "Josie as childhood nickname"
    ]
  },
  "grading": {
    "formula": "(correct_catches - false_positives) / total_errors",
    "pass": ">= 0.98 (39/40) AND usable style sheet AND within time limit",
    "false_positive_cap": 3,
    "style_sheet_criteria": [
      "All main characters listed with correct spellings",
      "Relationships noted",
      "Key terms and style decisions recorded",
      "Any queries or inconsistencies flagged"
    ],
    "feedback": {
      "pass": "Congratulations! You have demonstrated the skills required to proof fiction manuscripts accurately and efficiently. You are certified to begin supervised proof work.",
      "fail_accuracy": "You did not achieve 98% accuracy. Review your missed errors and retake with a new passage.",
      "fail_time": "You did not complete within the time limit. Work on your speed without sacrificing accuracy.",
      "fail_style_sheet": "Your style sheet was incomplete or unusable. Review the requirements and try again."
    }
  },
  "retake_policy": {
    "attempts": 2,
    "on_second_fail": "Return to Stage 4 for remediation before attempting again"
  }
}
